Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector Property
 Cannot move analytical surface because it will disconnect the analytical nodes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalSurfaceCannotMoveByConnector { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalSurfaceCannotMoveByConnector As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalSurfaceCannotMoveByConnector {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace